Config/Documents/ОбесценениеБА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОбесценениеБА</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерПервичногоДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПСРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КЭКРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПСДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КЭКДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяАналитикаСчета</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбесценения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбесцененияДоИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Documents/ОбесценениеБА/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	УправлениеМатериальнымиЗапасамиФормы.ДокументПриСозданииНаСервере(ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.УстановитьДоступностьРедактированияСтрокВДокументахНФА(ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ПодготовитьФормуНаСервере();
		ЗаполнитьСчетаДоходовРасходов();
		
	КонецЕсли;
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияИС
	ИнтеграцияИС.ПриСозданииНаСервереВФормеДокументаОснования(ЭтотОбъект, Объект, ИнтеграцияИС.ПараметрыИнтеграцииВФорме("ВетИС",ИнтеграцияИС.ИмяЭлементаДляРазмещения()));
	// Конец ИнтеграцияИС
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтотОбъект, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораИзПодбораМЗ(ИсточникВыбора) Тогда
		ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ДоступностьСвязанныхЭлементов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ПодготовитьФормуНаСервере();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СобытияФормИСКлиентПереопределяемый.ОбработкаНавигационнойСсылки(ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	ОбщегоНазначенияБГУКлиентСервер.ИзменитьДоступностьРедактированияСтрок(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);	

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ДоступностьСвязанныхЭлементов();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетРасходовПриИзменении(Элемент)
	УстановитьСвойстваЭлементовКорСчета("Расходов");
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовПриИзменении(Элемент)
	УстановитьСвойстваЭлементовКорСчета("Доходов");
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		МатериалыНоменклатураПриИзмененииНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
		ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, Элементы.Материалы.ТекущиеДанные, Не ЗначениеЗаполнено(ТекущиеДанные.СчетУчета));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ТекущиеДанные.Количество = 0 Тогда
		ЗаполнитьСуммыИзСтрокиОстатков(ТекущиеДанные, Неопределено);
	Иначе
		МатериалыКоличествоПриИзмененииНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаПриИзменении(Элемент)
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, Элементы.Материалы.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(ЭтотОбъект, "Счет105"),
		Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Дата,
		ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БиологическиеАктивы"));
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Если ОбщегоНазначенияБГУКлиентСервер.ЗапрещеноДобавлениеСтрокВДокументыНФА(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	ПараметрыПодбора = УправлениеМатериальнымиЗапасамиФормыКлиент.ПараметрыОткрытияПодбора();
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить(НСтр("ru = 'Организация'"));
	ПараметрыПодбора.ПроверяемыеРеквизиты = СтрСоединить(ПроверяемыеРеквизиты, ";");
	ПараметрыПодбора.РасширенныйПодбор = Истина;
	ПараметрыПодбора.ПараметрыОтбора = ДополнитьСтруктуруПодбора();
	Если Объект.Материалы.Количество() Тогда
		ПоместитьМатериалыВХранилищеНаСервере(ПараметрыПодбора);
	КонецЕсли;
	УправлениеМатериальнымиЗапасамиФормыКлиент.ОткрытьПодборМатериалов(ЭтотОбъект, Объект, ПараметрыПодбора);
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоместитьМатериалыВХранилищеНаСервере(ПараметрыПодбора)
	
	ПараметрыПодбора.ПараметрыТчДокумента = Новый Структура("АдресТчВХранилище");
	КолонкиРеквизитов = УправлениеМатериальнымиЗапасами.КолонкиПодбораДляВыгрузкиТабличнойЧасти(ЭтотОбъект.ПолучитьРеквизиты("Объект.Материалы"));
	ТаблицаМатериалы = Объект.Материалы.Выгрузить(,КолонкиРеквизитов);
	ПараметрыПодбора.ПараметрыТчДокумента.АдресТчВХранилище = ПоместитьВоВременноеХранилище(ТаблицаМатериалы, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетаДоходовРасходов()
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ДатаСчета = Объект.Дата;
	Иначе
		ДатаСчета = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.СчетДоходов) Тогда	
		Объект.СчетДоходов = БухгалтерскийУчет.СчетПоКоду("401.20", ДатаСчета, Объект.Организация);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.КЭКДоходов) Тогда
		Объект.КЭКДоходов = БухгалтерскийУчетПовтИсп.КЭКПоКоду("274");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СчетРасходов) Тогда	
		Объект.СчетРасходов = Объект.СчетДоходов;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.КЭКРасходов) Тогда
		Объект.КЭКРасходов = Объект.КЭКДоходов;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура МатериалыКоличествоПриИзмененииНаСервере(ИдентификаторСтроки)
	ТекущиеДанные = Объект.Материалы.НайтиПоИдентификатору(ИдентификаторСтроки);
	ЗаполнитьДанныеСтроки(ТекущиеДанные, "Количество");
КонецПроцедуры

&НаСервере
Процедура МатериалыНоменклатураПриИзмененииНаСервере(ИдентификаторСтроки)
	ТекущиеДанные = Объект.Материалы.НайтиПоИдентификатору(ИдентификаторСтроки);
	ЗаполнитьДанныеСтроки(ТекущиеДанные, "Номенклатура");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСтроки(ТекущиеДанные, ИзмененнаяКолонка)
	ОстаткиБА = РассчитатьОстатки(ТекущиеДанные.Номенклатура);
	Если ИзмененнаяКолонка = "Количество" Тогда
		Отбор = Новый Структура("СчетУчета, КПС, КФО, Подразделение");
		ЗаполнитьЗначенияСвойств(Отбор, ТекущиеДанные);
		СтрокиБА = ОстаткиБА.НайтиСтроки(Отбор);
		Если СтрокиБА.Количество() > 0 Тогда
			ЗаполнитьСуммыИзСтрокиОстатков(ТекущиеДанные, СтрокиБА[0]);	
		КонецЕсли;
	ИначеЕсли ИзмененнаяКолонка = "Номенклатура" Тогда
		Если ОстаткиБА.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ТекущиеДанные, ОстаткиБА[0], "СчетУчета, КПС, КФО");
			ЗаполнитьСуммыИзСтрокиОстатков(ТекущиеДанные, ОстаткиБА[0]);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовКорСчета(РасходовДоходов)
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("Подразделение" + РасходовДоходов);
	ИменаЭлементов.Добавить("Субконто" + РасходовДоходов + "1");
	ИменаЭлементов.Добавить("Субконто" + РасходовДоходов + "2");
	ИменаЭлементов.Добавить("Субконто" + РасходовДоходов + "3");
	
	ВидимостьЭлементов = Новый Массив(ИменаЭлементов.Количество());
	ОбязательностьЭлементов = Новый Массив(ИменаЭлементов.Количество());
	
	ПроверяемыйСчет = Объект["Счет" + РасходовДоходов];
	Если Не ЗначениеЗаполнено(ПроверяемыйСчет) Тогда
		ИменаЭлементов = Новый Массив;
		ИменаЭлементов.Добавить("Подразделение" + РасходовДоходов);
		ИменаЭлементов.Добавить("Субконто" + РасходовДоходов + "1");
		ИменаЭлементов.Добавить("Субконто" + РасходовДоходов + "2");
		ИменаЭлементов.Добавить("Субконто" + РасходовДоходов + "3");
		ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов, "Видимость", Ложь);
		Возврат;
	КонецЕсли;
	
	СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(ПроверяемыйСчет);
	ВидимостьЭлементов[0] = СвойстваСчета.УчетПоПодразделениям;
	ОбязательностьЭлементов[0] = СвойстваСчета.УчетПоПодразделениям И Не СвойстваСчета.РазрешитьНеУказыватьПодразделение;
	
	ИспользуемыеВидыСубконто = Новый Массив; // Массив из ПланВидовХарактеристикСсылка.ВидыСубконто
	Для Счетчик = 1 По СвойстваСчета.КоличествоСубконто Цикл
		ИспользуемыеВидыСубконто.Добавить(СвойстваСчета["ВидСубконто" + Счетчик]);
		ВидимостьЭлементов[Счетчик] = Истина;
		ОбязательностьЭлементов[Счетчик] = СвойстваСчета["ВидСубконто" + Счетчик + "Обязательный"]
	КонецЦикла;
	
	НаименованияСубконто = Новый Соответствие;
	Если ИспользуемыеВидыСубконто.Количество() > 0 Тогда
		НаименованияСубконто = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ИспользуемыеВидыСубконто, "Наименование");
	КонецЕсли;
	
	Для Индекс = 0 По ИменаЭлементов.ВГраница() Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИменаЭлементов[Индекс],
			"Видимость", ВидимостьЭлементов[Индекс] = Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИменаЭлементов[Индекс],
			"АвтоотметкаНезаполненного", ОбязательностьЭлементов[Индекс] = Истина);
		Если ВидимостьЭлементов[Индекс] = Истина И Индекс > 0 Тогда
			НаименованиеСубконто = НаименованияСубконто.Получить(СвойстваСчета["ВидСубконто" + Индекс]);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИменаЭлементов[Индекс],
				"Заголовок", НаименованиеСубконто);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ДатаПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		ЗаполнитьДанныеСчетовВФорме();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	ЗаполнитьДанныеСчетовВФорме();
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДинамическиеКолонкиВоВсехСтроках()
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	ОбщегоНазначенияБГУКлиентСервер.ИзменитьДоступностьРедактированияСтрок(Форма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСчетовВФорме(ДанныеСчетовВФорме = Неопределено)

	ПараметрыЗаполненияСчета = УправлениеМатериальнымиЗапасами.ПараметрыЗаполненияДанныхСчетовУчетаМЗВФорме();
	ПараметрыЗаполненияСчета.Организация = Объект.Организация;
	ПараметрыЗаполненияСчета.ДатаСчета = Объект.Дата;
	ПараметрыЗаполненияСчета.Включать113 = Истина;
	ПараметрыЗаполненияСчета.Включать106 = Ложь;
	ПараметрыЗаполненияСчета.Включать105 = Истина;
	ПараметрыЗаполненияСчета.СписокВыбора = Новый СписокЗначений;
	УправлениеМатериальнымиЗапасамиФормы.ЗаполнитьДанныеСчетовУчетаМЗВФорме(ЭтотОбъект, ПараметрыЗаполненияСчета,
		ДанныеСчетовВФорме);

	УправлениеМатериальнымиЗапасами.ЗаполнитьСчетаУчетаМЗ105(ЭтотОбъект);
	ОтключитьВидимостьКолонкиДопСубконто();
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ДатаСчетов = Объект.Дата;
	Иначе
		ДатаСчетов = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	
	СчетСсылка105 = БухгалтерскийУчет.СчетПоКоду("105.00", ДатаСчетов, Объект.Организация);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет105", СчетСсылка105);

	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет113",
		БухгалтерскийУчет.СчетПоКоду("113.00", ДатаСчетов, Объект.Организация));
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	ДанныеСчетовВФорме = Неопределено;
	ЗаполнитьДанныеСчетовВФорме(ДанныеСчетовВФорме);
	УстановитьДанныеДинамическихКолонокТаблицыМатериалы(ДанныеСчетовВФорме);
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	ЗаполнитьДинамическиеКолонкиВоВсехСтроках();
	УстановитьСвойстваЭлементовКорСчета("Расходов");
	УстановитьСвойстваЭлементовКорСчета("Доходов");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеДинамическихКолонокТаблицыМатериалы(ДанныеСчетовВФорме = Неопределено)
	ПараметрыЗаполненияКолонок = УправлениеМатериальнымиЗапасамиКлиентСервер.ЗаполнитьДинамическиеКолонки_Параметры(
		ЭтотОбъект, Объект);
	ПараметрыЗаполненияКолонок.Включать106 = Истина;
	ПараметрыЗаполненияКолонок.Включать113 = Истина;
	ПараметрыЗаполненияКолонок.ДанныеСчетов = ДанныеСчетовВФорме;
	УправлениеМатериальнымиЗапасамиКлиентСервер.ЗаполнитьДинамическиеКолонки(ПараметрыЗаполненияКолонок);
КонецПроцедуры

&НаСервере
Процедура ОтключитьВидимостьКолонкиДопСубконто()

	ПроверяемыеСчета = ВсеСчета113.ВыгрузитьЗначения();
	СписокСчетов = Новый СписокЗначений;
	СписокСчетов.ЗагрузитьЗначения(ПроверяемыеСчета);
	УправлениеМатериальнымиЗапасами.ОтключитьВидимостьКолонкиДопСубконто(Элементы.МатериалыДополнительнаяАналитикаСчета,
																		 ПроверяемыеСчета);

КонецПроцедуры

&НаКлиенте
Функция ДополнитьСтруктуруПодбора()
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("СчетУчета", ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(ЭтотОбъект, "Счет113"));
	ПараметрыПодбора.Вставить("НеИспользоватьСубконтоЦМО", Истина);
	ПараметрыПодбора.Вставить("ПоказыватьОстатки", Истина);
	ПараметрыПодбора.Вставить("ПоказыватьСчетУчета", Истина);
	ПараметрыПодбора.Вставить("ДополнитьСчетом113", Истина);
	ТипыНоменклатуры = Новый СписокЗначений;
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БиологическиеАктивы"));
	ПараметрыПодбора.Вставить("ТипыНоменклатуры",		ТипыНоменклатуры);
	ПараметрыПодбора.Вставить("ИмяТаблицы",				"Материалы");
	Возврат ПараметрыПодбора;

КонецФункции

&НаКлиенте
Процедура ДоступностьСвязанныхЭлементов()

//	Элементы.ПодразделениеОтправитель.Доступность 	= ЗначениеЗаполнено(Объект.Организация);
//	Элементы.ЦМООтправитель.Доступность				= ЗначениеЗаполнено(Объект.Организация);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСуммыИзСтрокиОстатков(ТекущиеДанные, СтрокаОстатков)
	Если СтрокаОстатков = Неопределено Тогда
		ТекущиеДанные.Сумма = 0;
		ТекущиеДанные.СуммаОбесцененияДоИзменения = 0;
	ИначеЕсли ТекущиеДанные.Количество = СтрокаОстатков.Количество Тогда
		ТекущиеДанные.Сумма = СтрокаОстатков.Сумма;
		ТекущиеДанные.СуммаОбесцененияДоИзменения = СтрокаОстатков.СуммаОбесцененияДоИзменения;
	ИначеЕсли СтрокаОстатков.Количество <> 0 Тогда
		ТекущиеДанные.Сумма = ТекущиеДанные.Количество * СтрокаОстатков.Сумма / СтрокаОстатков.Количество;
		ТекущиеДанные.СуммаОбесцененияДоИзменения = ТекущиеДанные.Количество
			* СтрокаОстатков.СуммаОбесцененияДоИзменения / СтрокаОстатков.Количество;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
	
	ТаблицаПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
	
	Если ТаблицаПодбора.Количество() Тогда
		
		ВыбраннаяНоменклатура = ТаблицаПодбора.ВыгрузитьКолонку("Номенклатура");
		ОстаткиБА = РассчитатьОстатки(ВыбраннаяНоменклатура);
		Отбор = Новый Структура("СчетУчета, КПС, КФО, Подразделение");
		
		ВтМатериалы = Объект.Материалы.Выгрузить();
		УправлениеМатериальнымиЗапасами.ЗаполнитьТаблицуИзПодбораМатериалов(ВтМатериалы, ТаблицаПодбора);
		
		Для Каждого СтрокаМатериалы Из ВтМатериалы Цикл
			Если СтрокаМатериалы.НоваяСтрока Тогда
				ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, СтрокаМатериалы, Ложь);
				ЗаполнитьЗначенияСвойств(Отбор, СтрокаМатериалы);
				СтрокиОстатков = ОстаткиБА.НайтиСтроки(Отбор);
				Если СтрокиОстатков.Количество() > 0 Тогда
					ЗаполнитьСуммыИзСтрокиОстатков(СтрокаМатериалы, СтрокиОстатков[0]);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Объект.Материалы.Загрузить(ВтМатериалы);
		УстановитьВидимостьЭлементов(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РассчитатьОстатки(Знач ВыбраннаяНоменклатура)
	
	Если ТипЗнч(ВыбраннаяНоменклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВыбраннаяНоменклатура = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбраннаяНоменклатура);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.КПС,
	|	ЖурналПроводокЕПСБУОстатки.КФО,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУОстатки.Счет В (&СчетаУчета)
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.Счет
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|		КОНЕЦ) КАК СчетУчета,
	|	Подстрока(ЖурналПроводокЕПСБУОстатки.Счет.Код, 6, 1) КАК АналитическийКод,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьУчетПоПодразделениям И ЖурналПроводокЕПСБУОстатки.Счет.УчетПоПодразделениям
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	СУММА(ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУОстатки.Счет В (&СчетаУчета)
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУОстатки.Счет В (&СчетаУчета)
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУОстатки.Счет В (&СчетаУчета)
	|			ТОГДА 0
	|		ИНАЧЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|	КОНЕЦ) КАК СуммаОбесцененияДоИзменения
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период,
	|			Счет В (&СчетаДляЗапроса),
	|			&ВидыСубконто,
	|			Организация = &Организация
	|			И &УсловиеИФО	
	|			И Субконто1 В (&Номенклатура)) КАК ЖурналПроводокЕПСБУОстатки
	|СГРУППИРОВАТЬ ПО
	|	Подстрока(ЖурналПроводокЕПСБУОстатки.Счет.Код, 6, 1),
	|	ЖурналПроводокЕПСБУОстатки.КПС,
	|	ЖурналПроводокЕПСБУОстатки.КФО,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто1 КАК Справочник.Номенклатура),
	|	ВЫБОР
	|		КОГДА &ИспользоватьУчетПоПодразделениям И ЖурналПроводокЕПСБУОстатки.Счет.УчетПоПодразделениям
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ
	|";
	Если Объект.Ссылка.Пустая() Тогда
		ПериодЗапроса = Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая);
	Иначе
		ПериодЗапроса = Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", ПериодЗапроса);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Номенклатура", ВыбраннаяНоменклатура);
	Запрос.УстановитьПараметр("ВидыСубконто",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура));
	Запрос.УстановитьПараметр("СчетаДляЗапроса", БухгалтерскийУчет.СписокСчетов("113.00, 114.00", Объект.Дата, ,
		Объект.Организация));
	Запрос.УстановитьПараметр("СчетаУчета", БухгалтерскийУчет.СписокСчетов("113.00", Объект.Дата, , Объект.Организация));
	Запрос.УстановитьПараметр("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО", "ИФО = &ИФО");
		Запрос.УстановитьПараметр("ИФО", Объект.ИФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО", "ИСТИНА");
	КонецЕсли;
	
	ТаблицаБА = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаБА;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДанныеСчетаВСтроке(Форма, Строка, ЗаполнятьСчет)
	
	ПараметрыОбработки = УправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыУстановкиСчетаУчетаВСтроке(Форма, Строка);
	ПараметрыОбработки.ЗаполнятьСчет = ЗаполнятьСчет;
	ПараметрыОбработки.ДтКт = "Кт";
	ПараметрыОбработки.Включать113 = Истина;
	ПараметрыОбработки.Включать106 = Ложь;
	
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеСчетаУчетаВСтроке(Строка, ПараметрыОбработки);
	
КонецПроцедуры
	
&НаСервере
Процедура УстановитьУсловноеОформление()

	УправлениеМатериальнымиЗапасами.УстановитьУсловноеОформлениеСпискаМатериалов(ЭтотОбъект, "Материалы", Истина);
	УправлениеМатериальнымиЗапасами.УстановитьУсловноеОформлениеКолонкиСуммаСписанияНУ(ЭтотОбъект);
	ПрослеживаемостьФормыБГУ.УстановитьУсловноеОформление(ЭтотОбъект);

КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ИмяФормы);
	
КонецПроцедуры

#КонецОбласти
 
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
